let tango = {
    anyone: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: '〔肯定文で〕 だれでも' },
    },
    anything: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: '〔肯定文で〕 何でも' },
    },
    everybody: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'だれでも、みんな' },
    },
    everyone: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'みなさん、みんな、だれでも　〔単数扱いで、everybody という言い方もある〕' },
    },
    everything: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あらゆること［もの］、何もかも　　〔単数扱い〕' },
    },
    he: {
        tags: ['三人称', '単数', '人称代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼は［が］、その（男の）人は［が］' },
    },
    her: {
        tags: ['三人称', '単数', '人称代名詞', '目的格','所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: ' 彼女を［に］' },
    },
    hers: {
        tags: ['三人称', '単数', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼女のもの' },
    },
    herself: {
        tags: ['三人称', '単数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼女自身を［に］、彼女自身で' },
    },
    him: {
        tags: ['三人称', '単数', '人称代名詞', '目的格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼を［に］' },
    },
    himself: {
        tags: ['三人称', '単数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼自身を［に］、彼自身で' },
    },
    his: {
        tags: ['三人称', '単数', '所有格', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼の' },
    },
    I: {
        tags: ['一人称', '単数', '人称代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私は［が］' },
    },
    it: {
        tags: ['三人称', '単数', '人称代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '《前に出た語句や文の内容を受けて》それは［が］' },
    },
    its: {
        tags: ['三人称', '単数', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'その、それの' },
    },
    many: {
        tags: ['不定代名詞', '複数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'たくさん（の人、物）' },
    },
    me: {
        tags: ['一人称', '単数', '人称代名詞', '目的格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'わたしに［を］' },
    },
    mine: {
        tags: ['一人称', '単数', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'わたしのもの' },
    },
    my: {
        tags: ['一人称', '単数', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私の' },
    },
    myself: {
        tags: ['一人称', '単数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私自身（で）　〔by myselfの形で〕 （私）ひとりで' },
    },
    nobody: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'だれも～ない' },
    },
    nothing: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: '何も～ない' },
    },
    our: {
        tags: ['一人称', '複数', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私たちの、ぼくたちの' },
    },
    ours: {
        tags: ['一人称', '複数', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私たちのもの、ぼくたちのもの' },
    },
    ourselves: {
        tags: ['一人称', '複数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私たち自身に［を］、ぼくたち自身に［を］' },
    },
    some: {
        tags: ['不定代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '（全体の中の）一部分、一部の人々' },
    },
    someone: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'だれか' },
    },
    something: {
        tags: ['不定代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: '何かあるもの［こと］' },
    },
    that: {
        tags: ['指示代名詞', '関係代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あれ、それ' },
    },
    their: {
        tags: ['三人称', '複数', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼らの、彼女らの、それらの' },
    },
    theirs: {
        tags: ['三人称', '複数', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼らのもの、彼女らのもの、それらのもの' },
    },
    them: {
        tags: ['三人称', '複数', '人称代名詞', '目的格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'それらを［に］、彼らを［に］、彼女たちを［に］' },
    },
    themselves: {
        tags: ['三人称', '複数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼ら〔彼女ら〕自身（で）' },
    },
    these: {
        tags: ['指示代名詞', '複数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'これらが［は］[を][に]' },
    },
    they: {
        tags: ['三人称', '複数', '人称代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '彼らが［は］、彼女たちが［は］、それらが［は］' },
    },
    this: {
        tags: ['指示代名詞', '単数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'これ' },
    },
    those: {
        tags: ['指示代名詞', '複数'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あれら、それら' },
    },
    us: {
        tags: ['一人称', '複数', '人称代名詞', '目的格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私たちを［に］' },
    },
    we: {
        tags: ['一人称', '複数', '人称代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: '私たちは［が］' },
    },
    what: {
        tags: ['疑問代名詞', '関係代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '何が［を、に］' },
    },
    which: {
        tags: ['疑問代名詞', '関係代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: '〔関係代名詞で〕～である［する］(ところの) ' },
    },
    who: {
        tags: ['疑問代名詞', '関係代名詞', '主格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'だれ' },
    },
    whose: {
        tags: ['疑問代名詞', '関係代名詞', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'だれのもの、だれの' },
    },
    you: {
        tags: ['二人称', '単数', '複数', '人称代名詞', '主格', '目的格'],
        hinsi: ['代名詞'],
        means: { 代名詞: ' あなた(たち)に［を］' },
    },
    your: {
        tags: ['二人称', '単数', '複数', '所有格'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あなた（たち）の' },
    },
    yours: {
        tags: ['二人称', '単数', '複数', '所有代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あなた（たち）のもの' },
    },
    yourself: {
        tags: ['二人称', '単数', '再帰代名詞'],
        hinsi: ['代名詞'],
        means: { 代名詞: 'あなた自身を［に］' },
    },
};