let tango = {
    can: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～できる、～してもよい' },
    },
    cannot: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～できない' },
    },
    could: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: 'canの過去形 ～できた' },
    },
    did: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔doの過去形で、疑問文や否定文を作るのに使う〕' },
    },
    do: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔疑問文と応答に用いる〕' },
    },
    does: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔主語が3人称単数の時の do の形で、疑問文や否定文を作るのに使う〕' },
    },
    has: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔現在完了の文において、主語が３人称単数の時の has の形で、疑問文や否定文を作るのに使う〕' },
    },
    have: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔have＋過去分詞の形で〕 《ある動作や状態が、過去から現在までずっと続いていることを表して》 ずっと～している、ずっと～だ' },
    },
    had: {
        tags: ['相助動詞'],
        hinsi: ['助動詞'],
        means: {
            助動詞: '〔had＋過去分詞の形で〕 《過去のある時点を基準として、それよりも前の出来事や状態を表して》 ～していた、したことがあった',
        },
    },
    may: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～かもしれない、することがある' },
    },
    must: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～しなければならない' },
    },
    shall: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: {
            助動詞: '(私たちは）～しましょうか',
        },
    },
    should: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～したほうがよい、～すべきである' },
    },
    shouldnt: {
        //shouldn'tにできない
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '〔should notの短縮形〕～するべきではない' },
    },
    will: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '《意思未来を表して》 ～するつもりである' },
    },
    would: {
        tags: ['法助動詞'],
        hinsi: ['助動詞'],
        means: { 助動詞: '～したいと思う' },
    },
};
