let tango = {
    aboard: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '（乗りものを使って）～に乗って' },
    },
    about: {
        tags: ['時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《関連を表して》 ～について' },
    },
    above: {
        tags: ['場所', '方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の上に' },
    },
    across: {
        tags: ['方向', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《位置を示して》 ～の向こう側に、～を横切って、（道などを横切った）反対側に' },
    },
    after: {
        tags: ['時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《時間を表して》 ～のあとに［で］　 〔after school の形で〕 放課後' },
    },
    against: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《敵対を表して》 ～にさからって、対して' },
    },
    along: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～に沿って、～沿いに ' },
    },
    among: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の中で［に］、～の間で［に］' },
    },
    around: {
        tags: ['方向', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の周りに［で］' },
    },
    as: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～として' },
    },
    at: {
        tags: ['時間', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《時の一点を表して》 ～に、～時に' },
    },
    before: {
        tags: ['時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《時間を表して》 ～（より）前に［の］' },
    },
    behind: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の後ろに、～の陰に' },
    },
    beside: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～のそばに' },
    },
    between: {
        tags: ['場所', '時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《場所・時間・関係を表して》 ～の間に［で、の］' },
    },
    by: {
        tags: ['手段', '場所', '時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《動作主を示して》 ～によって、～による〔主に受け身の文で〕' },
    },
    down: {
        tags: ['方向', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の下へ［に］、～を通って、～に沿って' },
    },
    during: {
        tags: ['時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《継続を表して》 ～の間は［に］' },
    },
    for: {
        tags: ['時間', '手段'],
        hinsi: ['前置詞'],
        means: {
            前置詞: '《用途を表して》 ～のために［の］、～用の、～にふさわしい  〔For here. の形で〕 ここで食べます《ファストフード店での会話表現》',
        },
    },
    from: {
        tags: ['方向', '手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《場所を示して》 ～から' },
    },
    in: {
        tags: ['場所', '時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《場所・空間・位置・関係を示して》～の中に［で］、～に［で］、～では、～において' },
    },
    including: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '（～を）含めて' },
    },
    into: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～へ［に］, ～の中へ［に、で］' },
    },
    like: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～のような［に］、～に似ている、～に似た' },
    },
    near: {
        tags: ['場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の近くの［に、で］' },
    },
    of: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《性質・属性・起源を表して》 ～の 〔たとえばthe leg of the tableの形で〕テーブルのあし' },
    },
    off: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～からはなれて' },
    },
    on: {
        tags: ['場所', '時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《手段・方法を示して》 ～で　〔たとえばon TVの形で〕テレビで' },
    },
    over: {
        tags: ['方向', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《ものの上や地域一帯を覆うことを示して》～の上に［で］' },
    },
    plus: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～を加えて' },
    },
    since: {
        tags: ['時間', '手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～以来（ずっと今まで）、～から今日まで' },
    },
    through: {
        tags: ['方向', '場所'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《原因・手段を表して》 ～によって、～を通じて' },
    },
    throw: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～を投げる' },
    },
    to: {
        tags: ['方向', '手段', 'to'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《動作の対象などを表して》 ～に、～に対して' },
    },
    toward: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の方へ、～に向かって' },
    },
    under: {
        tags: ['場所', '方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～の下に［へ、で、の］' },
    },
    until: {
        tags: ['時間'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～まで（ずっと）' },
    },
    up: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～をあがって' },
    },
    upon: {
        tags: ['方向'],
        hinsi: ['前置詞'],
        means: { 前置詞: '（基本的な意味は on とほぼ同じ）' },
    },
    with: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '《手段・道具を表して》 ～で、～を使って' },
    },
    without: {
        tags: ['手段'],
        hinsi: ['前置詞'],
        means: { 前置詞: '～なしで' },
    },
};
